package tasks01;
/*
    Напишите программу вычисления суммы четырёх слагаемых.
 */

public class Task5 {

    public static void main(String[] args) {
        double a = 1;
        double b = 2;
        double c = 3;
        double d = 4;
        double s;

        s = a + b + c + d;
        System.out.println("Сумма 4-х слагаемых" + s);

    }
}
